{"_id":"HelpOnMacros","body":"h2(prop). Macros\n\nMacros are functions you can call in a wiki page. There are a few simple macros implemented in !TapirWiki, this page tells you how to use them.\n\nh3(prop). Using a macro\n\nTo use a macro, simply include it in the markup for your page. The macros are contained in curly braces like  @{macro}@ and some take an additional argument, like so: @{macro:argument}@\n\nh3(prop). Macros implemented so far\n\nh4(prop). Goto\n\nUse a Goto macro if you want to create a link to a new or existing page in your wiki that you do not want to give a !CamelCase name (in which case the link is created automatically, unless you escape it by prefixing an exclamation mark as was done here). This macro like the automatic !CamelCase substitution is not a true macro in the sense that a function is called. It is more like markup.\n\nUsage: @{goto:some-page-name-which-does-not-need-to-be-in-camel-case}@\n\nh4(prop). Index\n\nThe index macro lists all pages in the wiki. The macro name is \"index\" and it takes no arguments. \n\nUsage: @{index}@\n\nResults in:\n\n{index}\n\nh4(prop). Topic List\n\nThe topic list macro finds all pages whose names begin with a given string. The macro name is \"topic\" and the argument is the first part of the page name which must match to be listed. \n\nUsage: @{topic:set-of-page-names-common-starting-string}@\n\nFor example, find all help pages in this Wiki: @{topic:HelpOn}@\n\nResults in: \n{topic:HelpOn}\n\n\n\nh4(prop). Recent Changes\n\nYou can provide a list of the 5 most recent page edits which have occurred using the recent changes macro. It's a nice one to include on your FrontPage so people know what's going on. The macro name is \"recentChanges\" and it takes no arguments. \n\nUsage: @{recentChanges}@\n\nResults in:\n{recentChanges}\n\nh4(prop). Includes\n\nYou can include the content from any page within the body of any other page. Use this macro to reduce duplication in your wiki. The macro name is \"include\" and the argument is the page name to include. \n\nUsage: @{include:name-page-to-be-included-here}@\n\nFor example, to include the Help page: @{include:Help}@\n\nResults in:\n{include:Help}\n\nIf the page you include cannot be found, you will get an error message and a link to the page. Following the link should enable you to edit the page.\nFor example @{include:PageWhichDoesNotExistYet}@\n\nResults in:\n{include:PageWhichDoesNotExistYet}\n\nh4(prop). Table of Contents\n\nThis macro adds a table of contents to the page. You can use jQuery selectors for the the headings you want to appear in the table of contents. \n\n@{toc:h2.prop,h3.prop,h4.prop}@\n\nResults in the Table of Contents in the right upper corner of the page. Note that it only selects headings which belong to the \"prop\" class.\n\n{toc:h2.prop,h3.prop,h4.prop}","edited_by":"System","edited_on":"Sat Oct 23 2010 22:35:22 GMT+0800 (CST)","type":"page","comment":""}

