{"_id":"HelpOnFormattingNotes","body":"h2. Notes on the Textile implementation of !TapirWiki \n\n[textile2]http://textile.thresholdstate.com/\n!TapirWiki uses \"Textile\":http://en.wikipedia.org/wiki/Textile_%28markup_language%29 as its primary light-weight markup language (support for other markup languages like \"Markdown\":http://en.wikipedia.org/wiki/Markdown will be added in due course). A custom textile parser/renderer was written for that purpose as other available !JavaScript parsers were deemed unsuitable. This parser supports the \"Textile 2.0 standard\":textile2 and also the supports what is detailed in  \"A Textile Reference\":http://redcloth.org/hobix.com/textile/ but with a few modifications:\n* Newlines are permitted in all block modifiers also in list items, \"textile 2.0\":textile2 does not permit newlines in list items.\n* Block modifiers are permitted anywhere where a block can appear in html, so also in table cells or list items (complex tables i.e. tables inside of table cells are however not yet supported).  \"Textile 2.0\":textile2 only allows blockmodifiers right at the start of a new line. When adding blockmodifiers in list items or table cells you must make sure it starts at the a the first character of that item or cell or at the first character after another block within that item or cell. Wherever a modifier is delimited by a full stop, this is actually a full stop plus the next space. So the first character of within the block is the character after that space. The last \"*\" or \"#\" of a list (item) modifier also includes a space. The table modifier \"|\" by itself does not though. You cannot start a table within a table though for now. You must revert to html for that.\n* Treatment of mixed lists is different, hopefully more consistent. For example you can start a numbered list in in an bullet list item. But a numbered list item cannot appear on the same level as a bullet list item (and vice versa). Unfortunately, you cannot yet start a subordinate list in a list item and after that subordinate list add more text in the same lisitem. This is also a limitation in \"Textile 2.0\":textile2\n* You must use the following order when listing attributes:\n1. col span (\"\\n\") then row span (\"/n\") only applicable to table cells, if any,\n2. indentation \"(\" or \")\" if any,\n3. horizontal alignment \"<\", \">\", \"=\" or \"<>\", if any,\n4. vertical alignment “^” or “~” (only for table rows and cells), if any,\n5. class/identifier within brackets \"(class#identifier)\", if any,\n6. language component \"[xx]\", if any,\n7. style component \"{attribute:value; attribue:value …}\", if any. \nSpaces are only allowed in the style component.\nAttributes in block componets are concluded with the \".\" of the block modifier. \nFor tables you put the attributes on its own line just before the table concluded by a full stop. \nTable row attributes are put right before the opening \"|\" of the row and are concluded by a full stop. \nIn header cells attribtes should be put right after the underscore and before the full stop.\nIn regular table cells put the attributes just after the opening \"|\" and +add+ a full stop.\nPut attributes for in lists just delimited with a full stop before  the opening \"==*==\" or  \"#\" to apply to the whole list, and after the last \"==*==\" or \"#\" to apply only to that list item (again delimited with a full stop). \nFor inline markup such like \"==%...%==\" or \"==*...*==\" add the attributes immediately after the opening modifier, no full stop is required.\n* Note that the \"Textile 2.0 standard page\":textile2 does not mention some modifiers that are nonetheless supported:\n** the \"bc..\" tag is for an extended code block only ended when a new explicit block style is encountered.\n** ==\"^~\"== in the attributes for vertical alignment of table cells (can apply to table rows or cells).\n** Link aliases (put ==[my-alias]http:www.example.com== anywhere in the page and you can then link to the alias like so ==\"MyLink\":my-alias==).\n* the pre. tag does not seem to be implemented in \"textile 2.0\":textile2 (although it is mentioned). Here it is and it acts just like the \"bc.\" tag but without the code formatting. There is also the extended version \"pre..\"\n* This parser does not interpret the html @<pre>@ tag as something else than html. In \"Textile 2.0\":textile2 it acts also as the \"pre.\" tag. \n* Finally the \"textile 2.0 standard page\":textile2 confusingly labels the tags to escape textile (notextile. for a block and \"==...==\" for inline) as \"Raw HTML\". You don't need to use any tag for raw HTML you can just put it in the text (but block html must start at the first character) and the parser will interpret it so. These tags are just to escape *textile* markup.","edited_by":"System","edited_on":"Thu May 27 2010 22:24:01 GMT+0800 (CST)","type":"page","comment":""}

